
{"index": {"_id": "e0d6f36b8e4ecd90e88cf1da55462f74347ad20b"}}
{"url":"http://mofa.gov.pk/ustad-karim-khalili-leader-hezb-e-wahdat-e-islami-afghanistan-calls-on-foreign-minister/","indexed_date":"2021-01-12 09:14:11","content_type":"html","language":"English","country":"Pakistan","statement":"Foreign Minister Makhdoom Shah Mahmood Qureshi received Ustad Mohammad Karim Khalili, Leader of the Hezb-e-Wahdat-e Islami, Afghanistan, and his accompanying delegation, today. During the meeting, views were exchanged on Pakistan-Afghanistan relations and progress in the Afghan peace process. The Foreign Minister reiterated Pakistan’s consistent support for a peaceful, stable and prosperous Afghanistan. He underscored that after the Afghans, Pakistan was the country most desirous of peace in Afghanistan. The Foreign Minister underlined that the people of Pakistan and Afghanistan were linked through immutable bonds of history, faith, culture and traditions. He reaffirmed Pakistan’s commitment to strengthening bilateral relations with Afghanistan in all fields. The Foreign Minister highlighted the various steps taken by Pakistan to strengthen bilateral and transit trade and introduction of revised visa policy to facilitate Afghan nationals. Foreign Minister Qureshi said Pakistan had always emphasized that there was no military solution of the Afghan conflict and that a negotiated political settlement was the only way forward. He stressed the importance of an inclusive, broad-based and comprehensive political solution through an Afghan-led and Afghan-owned peace process. Highlighting Pakistan’s positive contribution to the various milestones achieved so far, the Foreign Minister reaffirmed that Pakistan will continue to facilitate the Afghan peace process. He stressed that the Afghan leadership should seize this historic opportunity to establish lasting peace in Afghanistan through the Intra-Afghan Negotiations. The Foreign Minister reiterated Pakistan’s call on all sides to take measures for reduction in violence leading to ceasefire. He also cautioned against the role of ‘spoilers’ within and outside Afghanistan, who did not wish to see return of peace in Afghanistan and the region. Foreign Minister Qureshi further expressed the hope that the return of peace and stability in Afghanistan would provide a strong impetus to economic development, regional integration, and connectivity, benefitting Afghanistan and the region. Foreign Minister Qureshi also emphasized Pakistan’s commitment to safe and dignified return of Afghan refugees to their homeland. Ustad Karim Khalili thanked for Pakistan’s consistent support to Afghanistan, particularly in the peace process and for hosting millions of Afghan refugees for the last many decades. He appreciated the various steps taken by Pakistan to strengthen trade between the two countries and facilitate Afghan nationals through revised visa policy. Islamabad 12 January 2021","title":"Ustad Karim Khalili Leader Hezb-e-Wahdat-e Islami, Afghanistan calls on Foreign Minister","posted_date":"2021-01-12"}
